{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_19", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 30, 5], "dtype": "float32", "sparse": false, "name": "input_layer_12"}, "registered_name": null, "name": "input_layer_12", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Masking", "config": {"name": "masking_4", "trainable": true, "dtype": "float32", "mask_value": -999.0}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "masking_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["input_layer_12", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "PositionalEncoding", "config": {"position": 30, "d_model": 5, "trainable": true, "dtype": "float32"}, "registered_name": "PositionalEncoding", "build_config": {"input_shape": [null, 30, 5]}, "name": "positional_encoding_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["masking_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.1, "seed": null, "noise_shape": null}, "registered_name": null, "name": "dropout_17", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["positional_encoding_4", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_8", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 30, 5], "value_shape": [null, 30, 5]}}, "name": "multi_head_attention_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["positional_encoding_4", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["positional_encoding_4", 0, 0]}}], "kwargs": {"query_mask": null, "value_mask": null}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_16"}, "registered_name": "Add", "name": "add_16", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["dropout_17", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["multi_head_attention_8", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_16", "trainable": true, "dtype": "float32", "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "layer_normalization_16", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["add_16", 0, 0]}}], "kwargs": {}}]}, {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential_8", "trainable": true, "dtype": "float32", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 30, 5], "dtype": "float32", "sparse": false, "name": "input_layer_13"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 64]}}], "build_input_shape": [null, 30, 5]}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "sequential_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_16", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_17"}, "registered_name": "Add", "name": "add_17", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_16", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["sequential_8", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_17", "trainable": true, "dtype": "float32", "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "layer_normalization_17", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["add_17", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.1, "seed": null, "noise_shape": null}, "registered_name": null, "name": "dropout_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_17", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_9", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 30, 5], "value_shape": [null, 30, 5]}}, "name": "multi_head_attention_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_17", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_17", 0, 0]}}], "kwargs": {"query_mask": null, "value_mask": null}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_18"}, "registered_name": "Add", "name": "add_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["dropout_19", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["multi_head_attention_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_18", "trainable": true, "dtype": "float32", "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "layer_normalization_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["add_18", 0, 0]}}], "kwargs": {}}]}, {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential_9", "trainable": true, "dtype": "float32", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 30, 5], "dtype": "float32", "sparse": false, "name": "input_layer_14"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 64]}}], "build_input_shape": [null, 30, 5]}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "sequential_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_18", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_19"}, "registered_name": "Add", "name": "add_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_18", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["sequential_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_19", "trainable": true, "dtype": "float32", "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "layer_normalization_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["add_19", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAQAAAATAAAA8ywAAACVAZcAfABkAGQAhQKJAWoAAAAAAAAAAAALAGQAhQJm\nAhkAAAAAAAAAAABTAKkBTikB2hFzZXF1ZW5jZV9sZW5ndGhfbykC2gF42gRzZWxmcwIAAAAggPpO\nL3Zhci9mb2xkZXJzLzdwL3drXzAydGx4NzNkYjd5djB3dmJ4YzFqaDAwMDBnbi9UL2lweWtlcm5l\nbF80NTU3Ni8zMjQ5MTcwNDI4LnB5+gg8bGFtYmRhPvouRGpGbG93Ll9jcmVhdGVfZGVmYXVsdF9t\nb2RlbC48bG9jYWxzPi48bGFtYmRhPpwAAABzIQAAAPiAAKhRqHGocahxsDTUM0nQMknQMkrQMkrQ\nL0rULUuAAPMAAAAA\n", "defaults": null, "closure": [{"module": null, "class_name": "DjFlow", "config": {"sequence_length_i": 30, "sequence_length_o": 10, "num_instruments": 1, "model_type": "transformer", "n_layers": 2, "n_units": [64, 64], "dropout": [0.1, 0.1], "batch_size": 32, "learning_rate": 0.005, "loss_weights": {"pitch": 1.0, "duration": 1.0, "offset": 1.0, "time_delta": 100.0, "instrument_index": 100.0}, "means": [63.52300040192926, 0.20707270222590415, 232.64356262142414, 5.668882919263311], "stds": [11.323652637034675, 0.29645408076695823, 148.49149701305905, 42.9951681402217]}, "registered_name": "DjFlow"}]}}, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 30, 5]}, "name": "lambda_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 5], "dtype": "float32", "keras_history": ["layer_normalization_19", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "pitch", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 5]}, "name": "pitch", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 5], "dtype": "float32", "keras_history": ["lambda_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "duration", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 5]}, "name": "duration", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 5], "dtype": "float32", "keras_history": ["lambda_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "offset", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 5]}, "name": "offset", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 5], "dtype": "float32", "keras_history": ["lambda_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "time_delta", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10, 5]}, "name": "time_delta", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 5], "dtype": "float32", "keras_history": ["lambda_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "instrument_index", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5]}}}, "registered_name": null, "build_config": {"input_shape": [null, 10, 5]}, "name": "instrument_index", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 5], "dtype": "float32", "keras_history": ["lambda_4", 0, 0]}}], "kwargs": {"mask": null}}]}], "input_layers": [["input_layer_12", 0, 0]], "output_layers": [["pitch", 0, 0], ["duration", 0, 0], ["offset", 0, 0], ["time_delta", 0, 0], ["instrument_index", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.004999999888241291, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": {"pitch": "mean_squared_error", "duration": "mean_squared_error", "offset": "mean_squared_error", "time_delta": "mean_squared_error", "instrument_index": "binary_crossentropy"}, "loss_weights": {"pitch": 1.0, "duration": 1.0, "offset": 1.0, "time_delta": 100.0, "instrument_index": 100.0}, "metrics": {"instrument_index": ["accuracy"]}, "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}